CSI API ETABS v1
cDStItalianNTC2018S Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDStItalianNTC2018S
Public Interface cDStItalianNTC2018S
Dim instance As cDStItalianNTC2018S
public interface class cDStItalianNTC2018S
type cDStItalianNTC2018S =  interface end
The cDStItalianNTC2018S type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a steel design overwrite item
GetPreference
 Retrieves the value of a steel design preference item.
SetOverwrite
 Sets the value of a steel design overwrite item
SetPreference
 Sets the value of a steel design preference item.
Top
See Also
Reference
ETABSv1 Namespace